// function withdraw(amount, balance) {
//   if (amount === 0) {
//     console.log("Для проведення операції введіть суму більшу за нуль");
//   } else if (amount > balance) {
//     console.log("Недостатньо коштів на рахунку");
//   } else {
//     console.log("Операція зняття коштів проведена успішно");
//   }
// }

// withdraw(0, 300); // "Для проведення операції введіть суму більшу за нуль"
// withdraw(500, 300); // "Недостатньо коштів на рахунку"
// withdraw(100, 300); // "Операція зняття коштів проведена успішно"


// function withdraw(amount, balance) {
//   // Якщо умова виконується, викликається console.log
//   // і вихід із функції. Код після тіла if не виконується.
//   if (amount === 0) {
//     // throw new Error()
//     return null;
//   }

//   // Якщо умова першого if не виконалась, його тіло пропускається
//   // та інтерпретатор доходе до другого if.
//   // Якщо умова виконується, викликається console.log і вихід із функції.
//   // Код, що знаходиться після тіла if, не виконується.
//   if (amount > balance) {
//     // throw new Error();
//     return null;
//   }

//   // Якщо жоден із попередніх if не виконався,
//   // інтерпретатор доходить до цього коду і виконує його.
//   return "Операція зняття коштів проведена";
// }

// withdraw(0, 300); // "Для проведення операції введіть суму більшу за нуль"
// withdraw(500, 300); // "Недостатньо коштів на рахунку"
// withdraw(100, 300); // "Операція зняття коштів проведена"


function withdraw(amount, balance) {
    switch (true){
        case amount === 0:
            return null;
        case amount > balance:
            return null;
         default:
            return "Операція зняття коштів проведена";
    }
}

console.log(withdraw(0, 300)); // "Для проведення операції введіть суму більшу за нуль"
console.log(withdraw(500, 300)); // "Недостатньо коштів на рахунку"
console.log(withdraw(100, 300)); // "Операція зняття коштів проведена"



// ----

// function foo() {
//   foo(); // Рекурсивний виклик
// }

// foo();